Revit 2024 API
PipeSettings Class
 The pipe setting class.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public class PipeSettings : Element
Visual Basic
Public Class PipeSettings _
	Inherits Element
Visual C++
public ref class PipeSettings : public Element
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Plumbing.PipeSettings
See Also
PipeSettings Members
Autodesk.Revit.DB.Plumbing Namespace